'''Создать отдельный файл storage2.py и реализовать в нём перечисленные ниже функции и классы.
Создать файл test2.py и написать в нём тесты для функций модуля.
def add_contact(name, phone)
Описание: функция создаёт контакт с заданным именем и телефоном и сохраняет его в текстовый файл book.txt.
Параметры:

name: String – полное имя пользователя ("John Doe")
phone: String – номер телефона пользователя ("+7999")
Возвращаемое значение:
contact: Contact – созданный контакт

class Contact
Конструкторы:
Contact(name, phone)
Свойства:
name: String – полное имя пользователя ("John Doe")
phone: String – номер телефона пользователя ("+7999")
Методы: нет'''
